%%% @file dao_cat.erl
%%%
%%%    Бизнес логика раздачи рекламных креативов.
%%%

-module(dao_cat).

-export([
    get_all_cats/1,
    test/0,
    test/1
]).

-include("common.hrl").

%%% @doc
%%% Возвращает список всех категорий
%%%     (список mark, c типом Categories)
%%%
get_all_cats(_) ->
    Query  = <<"select mark.id, mark.name, mark.seo_alias from mark "
                "join mark_type on mark.mark_type_id = mark_type.id "
            "where mark_type.name=\"Categories\"; ">>,
    mysql_dao:simple(Query).


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

-include_lib("eunit/include/eunit.hrl").

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%
%%% Юнит тестирование
%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

test()->
    ok.

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%
%%% Нагрузочное тестирование
%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

test(speed)->

    ok.

